## **RESOLUCIÓN EVALUACIÓN MÓDULO 2:**
#### **ANÁLISIS DE DATOS**

- Librerías

In [1]:
# Tratamiento de datos
# -----------------------------------------------------------------------
import pandas as pd
import numpy as np

# Libreria Regex para buscar patrones
import re

# Imputación de nulos usando métodos avanzados estadísticos
# -----------------------------------------------------------------------
from sklearn.impute import SimpleImputer
from sklearn.experimental import enable_iterative_imputer
from sklearn.impute import IterativeImputer
from sklearn.impute import KNNImputer

# Librerías de visualización
# -----------------------------------------------------------------------
import seaborn as sns
import matplotlib.pyplot as plt
# Configuración
# -----------------------------------------------------------------------
pd.set_option('display.max_columns', None) # para poder visualizar todas las columnas de los DataFrames
pd.set_option('display.max_rows', None)
pd.set_option('display.max_colwidth', None)

#### **Fase 1: Exploración y Limpieza**

**2. Limpieza de Datos:**

• Elimina o trata los valores nulos, si los hay, en las columnas clave para
asegurar que los datos estén completos.

• Verifica la consistencia y corrección de los datos para asegurarte de que
los datos se presenten de forma coherente.

• Realiza cualquier ajuste o conversión necesaria en las columnas (por
ejemplo, cambiar tipos de datos) para garantizar la adecuación de los
datos para el análisis estadístico.

In [2]:
df_aerolinea = pd.read_csv("aerolinea.csv", index_col = None)

- Creación copias de los Dataframes para trabajar con seguridad

In [3]:
df_aerolinea_copy = df_aerolinea.copy()
df_aerolinea_copy.head()

,Loyalty Number,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed,Country,Province,City,Postal Code,Gender,Education,Salary,Marital Status,Loyalty Card,CLV,Enrollment Type,Enrollment Year,Enrollment Month,Cancellation Year,Cancellation Month
0,100018,2017,1,3,0,3,1521,152.0,0,0,Canada,Alberta,Edmonton,T9G 1W3,Female,Bachelor,92552.0,Married,Aurora,7919.2,Standard,2016,8,NaN,NaN
1,100018,2017,2,2,2,4,1320,132.0,0,0,Canada,Alberta,Edmonton,T9G 1W3,Female,Bachelor,92552.0,Married,Aurora,7919.2,Standard,2016,8,NaN,NaN
2,100018,2018,10,6,4,10,3110,311.0,385,31,Canada,Alberta,Edmonton,T9G 1W3,Female,Bachelor,92552.0,Married,Aurora,7919.2,Standard,2016,8,NaN,NaN
3,100018,2017,4,4,0,4,924,92.0,0,0,Canada,Alberta,Edmonton,T9G 1W3,Female,Bachelor,92552.0,Married,Aurora,7919.2,Standard,2016,8,NaN,NaN
4,100018,2017,5,0,0,0,0,0.0,0,0,Canada,Alberta,Edmonton,T9G 1W3,Female,Bachelor,92552.0,Married,Aurora,7919.2,Standard,2016,8,NaN,NaN

- **Variables Categóricas**

In [4]:
# Cargar el Dataframe con las variables de tipo categóricas

df_aerolinea_copy[["Country", "Province", "City", "Postal Code", "Gender", "Education", "Marital Status", "Loyalty Card", "Enrollment Type"]].sample(10)

,Country,Province,City,Postal Code,Gender,Education,Marital Status,Loyalty Card,Enrollment Type
139581,Canada,Ontario,Toronto,P5S 6R4,Female,Bachelor,Married,Star,Standard
229543,Canada,Manitoba,Winnipeg,R2C 0M5,Female,College,Single,Star,Standard
168665,Canada,Ontario,Ottawa,K1F 2R2,Female,College,Single,Star,Standard
154321,Canada,Ontario,Toronto,P1J 8T7,Male,Bachelor,Divorced,Star,Standard
288905,Canada,British Columbia,Whistler,V6T 1Y8,Male,Bachelor,Divorced,Nova,2018 Promotion
12348,Canada,Ontario,Toronto,M1R 4K3,Male,Bachelor,Married,Star,Standard
192135,Canada,Ontario,Toronto,P2T 6G3,Male,College,Single,Aurora,Standard
269936,Canada,Ontario,Toronto,P1J 8T7,Female,Master,Single,Star,Standard
225694,Canada,Alberta,Edmonton,T3G 6Y6,Female,Master,Single,Nova,Standard
277888,Canada,British Columbia,Vancouver,V1E 4R6,Female,College,Single,Nova,Standard

In [5]:
# Columnas categóricas con valores únicos por cada columna

col_cat_unique = ["Country", "Province", "City", "Postal Code", "Gender", "Education", "Marital Status", "Loyalty Card", "Enrollment Type"]

for columna in col_cat_unique:
    print(f"Los valores únicos de la columna '{columna}':\n")
    valores_unicos = df_aerolinea_copy[columna].unique()
    print(valores_unicos)
    print("______________________\n")

Los valores únicos de la columna 'Country':

['Canada']
______________________

Los valores únicos de la columna 'Province':

['Alberta' 'Ontario' 'British Columbia' 'Saskatchewan' 'Quebec'
 'Newfoundland' 'Manitoba' 'New Brunswick' 'Nova Scotia'
 'Prince Edward Island' 'Yukon']
______________________

Los valores únicos de la columna 'City':

['Edmonton' 'Toronto' 'Dawson Creek' 'Vancouver' 'Regina' 'Montreal'
 'Sudbury' 'Quebec City' 'Peace River' "St. John's" 'Tremblant' 'Ottawa'
 'Trenton' 'Winnipeg' 'Thunder Bay' 'West Vancouver' 'Fredericton'
 'London' 'Halifax' 'Moncton' 'Banff' 'Kingston' 'Whistler'
 'Charlottetown' 'Hull' 'Victoria' 'Calgary' 'Kelowna' 'Whitehorse']
______________________

Los valores únicos de la columna 'Postal Code':

['T9G 1W3' 'M1R 4K3' 'U5I 4F1' 'V5R 1W3' 'P1L 8X8' 'P1J 8T7' 'S6J 3G0'
 'H2T 9K8' 'V6E 3D9' 'M5V 1G5' 'H2Y 4R4' 'M8Y 4K8' 'V6E 3Z3' 'G1B 3L5'
 'T9O 2W2' 'A1C 6H9' 'H5Y 2S9' 'K1F 2R2' 'K8V 4B2' 'R3R 3T4' 'P1W 1K4'
 'K8T 5M5' 'V6V 8Z3' 'M2M 7K8' 'E3B 2H2' 'M5B 3E4' 'H2Y 2W2' 'P5S 6R4'
 'P2T 6G3' 'B3J 9S2' 'B3C 2M8' 'H4G 3T4' 'R6Y 4T5' 'H2T 2J6' 'M2Z 4K1'
 'S1J 3C5' 'E1A 2A7' 'V1E 4R6' 'T4V 1D4' 'M9K 2P4' 'R2C 0M5' 'T3G 6Y6'
 'M2M 6J7' 'V6T 1Y8' 'C1A 6E8' 'J8Y 3Z5' 'V10 6T5' 'H3T 8L4' 'T3E 2V9'
 'V09 2E9' 'Y2K 6R0' 'K1G 4Z0' 'M2P 4F6' 'M3R 4K8' 'H3J 5I6']
______________________

Los valores únicos de la columna 'Gender':

['Female' 'Male']
______________________

Los valores únicos de la columna 'Education':

['Bachelor' 'College' 'Master' 'High School or Below' 'Doctor']
______________________

Los valores únicos de la columna 'Marital Status':

['Married' 'Single' 'Divorced']
______________________

Los valores únicos de la columna 'Loyalty Card':

['Aurora' 'Nova' 'Star']
______________________

Los valores únicos de la columna 'Enrollment Type':

['Standard' '2018 Promotion']
______________________

- **Variables Numéricas**

In [8]:
# Cargar el Dataframe con las variables de tipo numéricas tipo "int"

df_aerolinea_copy[["Loyalty Number", "Year", "Month", "Flights Booked", "Flights with Companions", "Total Flights", "Distance", "Points Redeemed", "Dollar Cost Points Redeemed", "Enrollment Year", "Enrollment Month"]].sample(10)

,Loyalty Number,Year,Month,Flights Booked,Flights with Companions,Total Flights,Distance,Points Redeemed,Dollar Cost Points Redeemed,Enrollment Year,Enrollment Month
331494,921392,2017,7,0,0,0,0,0,0,2018,7
241266,690029,2018,7,13,2,15,5175,0,0,2014,5
31166,175017,2018,5,3,3,6,2268,0,0,2016,11
49134,217235,2017,7,0,0,0,0,0,0,2013,4
72547,275386,2018,8,13,7,20,1540,0,0,2012,8
2342,105214,2018,2,0,0,0,0,0,0,2013,8
58682,242377,2017,3,0,0,0,0,0,0,2018,4
231631,665890,2017,9,0,0,0,0,0,0,2016,6
340273,944821,2017,2,0,0,0,0,0,0,2017,3
16807,139974,2017,8,0,0,0,0,0,0,2018,11

In [13]:
# Columnas numéricas tipo "int" con valores únicos por cada columna

col_num_int = ["Loyalty Number", "Year", "Month", "Flights Booked", "Flights with Companions", "Total Flights", "Distance", "Points Redeemed", "Dollar Cost Points Redeemed", "Enrollment Year", "Enrollment Month"]

for columna in col_num_int:
    print(f"Los valores únicos de la columna '{columna}':\n")
    valores_unicos = df_aerolinea_copy[columna].unique()
    num_valores_unicos = len(valores_unicos)
    print(f"Cantidad de valores únicos: {num_valores_unicos}\nValores únicos: {valores_unicos}")
    print("______________________\n")

Los valores únicos de la columna 'Loyalty Number':

Cantidad de valores únicos: 16737
Valores únicos: [100018 100102 100140 ... 999731 999788 999891]
______________________

Los valores únicos de la columna 'Year':

Cantidad de valores únicos: 2
Valores únicos: [2017 2018]
______________________

Los valores únicos de la columna 'Month':

Cantidad de valores únicos: 12
Valores únicos: [ 1  2 10  4  5  6  7  9  8 11 12  3]
______________________

Los valores únicos de la columna 'Flights Booked':

Cantidad de valores únicos: 22
Valores únicos: [ 3  2  6  4  0 10  9 13  1 14  7  5 11 17  8 15 12 16 20 18 19 21]
______________________

Los valores únicos de la columna 'Flights with Companions':

Cantidad de valores únicos: 12
Valores únicos: [ 0  2  4  1  5  3  7  6  8  9 10 11]
______________________

Los valores únicos de la columna 'Total Flights':

Cantidad de valores únicos: 33
Valores únicos: [ 3  4 10  0  5 13 15  6 14  1 17  7 16 11 23  9  8 18 19 12 21  2 20 22
 28 26 29 27 25 24 30 31 32]
______________________

Los valores únicos de la columna 'Distance':

Cantidad de valores únicos: 4746
Valores únicos: [1521 1320 3110 ... 6014 6262 1277]
______________________

Los valores únicos de la columna 'Points Redeemed':

Cantidad de valores únicos: 587
Valores únicos: [  0 385 690 438 510 685 593 459 402 393 614 464 546 371 559 561 581 335
 828 495 431 683 341 514 434 512 502 644 712 556 365 324 353 468 425 555
 493 549 760 410 340 579 501 770 505 681 389 325 484 342 552 382 737 698
 608 444 487 471 746 576 548 373 567 379 454 507 448 366 488 541 678 376
 511 509 761 506 397 523 676 364 440 449 407 419 528 564 308 594 344 539
 489 465 719 467 358 547 632 368 524 457 289 551 742 526 310 309 455 473
 403 363 589 519 333 391 570 474 445 442 640 435 733 687 522 667 458 628
 765 613 497 415 387 327 396 312 450 639 405 481 600 588 582 469 508 406
 531 706 662 482 466 343 566 386 404 669 607 417 618 553 557 480 478 647
 625 708 623 491 412 423 796 500 436 729 408 348 784 424 726 503 516 565
 332 554 383 668 788 595 558 374 739 413 298 433 453 631 429 574 345 641
 357 394 533 496 655 601 529 293 587 362 666 451 656 461 398 748 409 612
 483 292 757 485 352 753 682 818 349 605 643 619 494 867 550 535 422 664
 490 673 740 311 686 421 515 319 689 654 456 447 720 328 814 696 460 521
 841 470 857 727 787 596 671 384 320 677 430 527 370 862 817 418 575 314
 351 401 826 545 569 472 663 670 806 609 629 388 680 439 580 638 583 354
 463 736 378 477 819 704 572 306 544 679 562 782 400 534 355 479 661 432
 513 538 300 660 336 781 617 563 361 610 592 543 651 718 615 499 437 329
 347 426 414 392 411 441 476 321 777 700 498 585 350 606 372 337 504 873
 395 598 322 356 571 475 744 304 653 525 390 747 427 568 797 776 291 323
 843 334 560 339 330 486 800 783 635 492 313 602 694 530 815 652 622 381
 443 642 646 650 731 367 785 586 577 599 812 452 778 717 326 665 573 692
 645 621 591 290 705 710 627 674 536 769 542 756 840 633 299 861 369 360
 517 428 675 316 766 302 709 416 520 359 749 693 626 807 649 380 578 825
 346 331 832 377 713 695 707 741 634 691 771 657 420 794 688 730 603 537
 786 462 375 604 318 446 620 658 758 338 752 540 824 754 875 750 835 743
 399 637 697 305 648 721 734 684 317 584 307 636 297 849 723 798 611 701
 820 590 745 838 722 833 597 518 792 811 735 863 624 724 779 616 672 630
 703 728 801 532 854 850 805 837 821 836 772 699 809 659 715 789 315 301
 716 851 804 831 714 799 822 775 711 294 702 732 813 808 762 802 763 725
 839 751 773 755 842 780 793 870 846 738 855 827 774 816 830 790 764 844
 791 868 767 803 829 823 852 303 847 845 768 860 848 810 759 864 295 296
 872 871 876 795 866 858 874 865 859 834 869]
______________________

Los valores únicos de la columna 'Dollar Cost Points Redeemed':

Cantidad de valores únicos: 49
Valores únicos: [ 0 31 56 36 41 55 48 37 33 32 50 38 44 30 45 47 27 67 40 35 28 42 52 57
 26 29 34 61 62 39 59 49 60 46 43 25 58 51 24 54 53 64 63 66 70 68 69 65
 71]
______________________

Los valores únicos de la columna 'Enrollment Year':

Cantidad de valores únicos: 7
Valores únicos: [2016 2013 2015 2014 2012 2017 2018]
______________________

Los valores únicos de la columna 'Enrollment Month':

Cantidad de valores únicos: 12
Valores únicos: [ 8  3  7  1  9  5 10  2  4  6 11 12]
______________________

In [14]:
# Cargar el Dataframe con las variables de tipo numéricas tipo "float"

df_aerolinea_copy[["Points Accumulated", "Salary", "CLV", "Cancellation Year", "Cancellation Month"]].sample(10)

,Points Accumulated,Salary,CLV,Cancellation Year,Cancellation Month
146079,0.0,98305.0,6627.15,NaN,NaN
363691,0.0,66971.0,2476.48,NaN,NaN
78185,319.0,52671.0,7434.68,NaN,NaN
200512,0.0,60235.0,4834.71,NaN,NaN
259802,215.0,47987.0,3703.93,NaN,NaN
206932,187.0,NaN,2711.90,NaN,NaN
158243,0.0,84147.0,8044.87,NaN,NaN
75845,0.0,56493.0,9388.98,NaN,NaN
91957,0.0,50895.0,7851.90,2016.0,8.0
302767,190.0,NaN,6582.45,NaN,NaN

In [15]:
# Columnas numéricas tipo "float" con valores únicos por cada columna

col_num_float = ["Points Accumulated", "Salary", "CLV", "Cancellation Year", "Cancellation Month"]

for columna in col_num_float:
    print(f"Los valores únicos de la columna '{columna}':\n")
    valores_unicos = df_aerolinea_copy[columna].unique()
    num_valores_unicos = len(valores_unicos)
    print(f"Cantidad de valores únicos: {num_valores_unicos}\nValores únicos: {valores_unicos}")
    print("______________________\n")

Los valores únicos de la columna 'Points Accumulated':

Cantidad de valores únicos: 1549
Valores únicos: [152.   132.   311.   ...  18.75 601.   626.  ]
______________________

Los valores únicos de la columna 'Salary':

Cantidad de valores únicos: 5891
Valores únicos: [92552.    nan 63253. ... 23160. 97206. 56345.]
______________________

Los valores únicos de la columna 'CLV':

Cantidad de valores únicos: 7984
Valores únicos: [7919.2  2887.74 2838.07 ... 6990.69 3151.16 8409.07]
______________________

Los valores únicos de la columna 'Cancellation Year':

Cantidad de valores únicos: 7
Valores únicos: [  nan 2018. 2015. 2016. 2014. 2013. 2017.]
______________________

Los valores únicos de la columna 'Cancellation Month':

Cantidad de valores únicos: 13
Valores únicos: [nan  3.  9.  2.  7.  6.  8.  4.  1.  5. 11. 12. 10.]
______________________